adafruit/tinyuf2/ports/mimxrt10xx/apps/factory_test_metro_sd/middleware-sdmmc/sdspi/fsl_sdspi.c
    uint32_t applicationCommand41Argument = 0U;

    card->host->init();

    /* Card must be initialized in 400KHZ. */
    if (card->host->setFrequency(SDMMC_CLOCK_400KHZ) != kStatus_Success)
    {
        return kStatus_SDSPI_SetFrequencyFailed;
    }

    /* send 80 clock to active card */
    (void)SDSPI_SendCardActive(card);

    /* Reset the card by CMD0. */
    if (kStatus_Success != SDSPI_GoIdle(card))
    {
        return kStatus_SDSPI_GoIdleFailed;
    }

    /* CMD8: Check the card's supported interface condition. */
    if (kStatus_Success != SDSPI_SendInterfaceCondition(card, &applicationCommand41Argument))
    {
        return kStatus_SDSPI_SendInterfaceConditionFailed;
    }

#if SDSPI_CARD_CRC_PROTECTION_ENABLE
    /* enable command crc protection. */
    if (kStatus_Success != SDSPI_CommandCrc(card, true))
    {
        return kStatus_SDSPI_SwitchCmdFail;
    }
#endif

    /* ACMD41 (0x77, 0x69): Set card's interface condition according to host's capability and card's supported interface condition */
    if (kStatus_Success != SDSPI_ApplicationSendOperationCondition(card, applicationCommand41Argument))
    {
        return kStatus_SDSPI_SendOperationConditionFailed;
    }

    // CMD58 (0x7A)
    if (kStatus_Success != SDSPI_ReadOcr(card))
    {
        return kStatus_SDSPI_ReadOcrFailed;
    }

    /* CMD16 (0x50) Force to use 512-byte length block, no matter which version.  */
    if (kStatus_Success != SDSPI_SetBlockSize(card, FSL_SDSPI_DEFAULT_BLOCK_SIZE))
    {
        return kStatus_SDSPI_SetBlockSizeFailed;
    }

    /* CMD9 (0x49) get csd */
    if (kStatus_Success != SDSPI_SendCsd(card))
    {
        return kStatus_SDSPI_SendCsdFailed;
    }

    /* Set to max frequency according to the max frequency information in CSD register. */
    if (kStatus_Success !=
        card->host->setFrequency(SD_CLOCK_25MHZ > card->host->busBaudRate ? card->host->busBaudRate : SD_CLOCK_25MHZ))
    {
        return kStatus_SDSPI_SetFrequencyFailed;
    }

    if (kStatus_Success != SDSPI_SendScr(card))
    {
        return kStatus_SDSPI_SendCsdFailed;
    }

    return kStatus_Success;
}

void SDSPI_Deinit(sdspi_card_t *card)
{
    assert(card != NULL);

    if (card->host->deinit != NULL)
    {
        card->host->deinit();
    }

    (void)memset(card, 0, sizeof(sdspi_card_t));
}

bool SDSPI_CheckReadOnly(sdspi_card_t *card)
{
    assert(card != NULL);

    if (((card->csd.flags & (uint16_t)kSD_CsdPermanentWriteProtectFlag) != 0U) ||
        ((card->csd.flags & (uint16_t)kSD_CsdTemporaryWriteProtectFlag) != 0U))
    {
        return true;
    }

    return false;
}

status_t SDSPI_ReadBlocks(sdspi_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(card->host != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);

    uint32_t i;
    uint8_t response = 0U;

    /* send command */
    if (kStatus_Success !=
        SDSPI_SendCommand(
            card->host, blockCount == 1U ? (uint32_t)kSDSPI_CmdReadSigleBlock : (uint32_t)kSDSPI_CmdReadMultiBlock,
            ((card->flags & (uint32_t)kSDSPI_SupportHighCapacityFlag) == 0U ? (startBlock * card->blockSize) :
                                                                              startBlock),
            &response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }
    /* read data */
    for (i = 0U; i < blockCount; i++)
    {
        if (kStatus_Success != SDSPI_Read(card->host, buffer, card->blockSize))
        {
            return kStatus_SDSPI_ReadFailed;
        }
        buffer = (uint8_t *)((uint32_t)buffer + card->blockSize);
    }

    /* Write stop transmission command after the last data block. */
    if (blockCount > 1U)
    {
        if (kStatus_Success != SDSPI_StopTransmission(card))
        {
            return kStatus_SDSPI_StopTransmissionFailed;
        }
    }

    return kStatus_Success;
}

status_t SDSPI_WriteBlocks(sdspi_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(card->host != NULL);
    assert(buffer != NULL);
    assert(blockCount != 0U);

    uint32_t i;
    uint8_t response = 0U;

    if (SDSPI_CheckReadOnly(card))
    {
        return kStatus_SDSPI_WriteProtected;
    }

    /* send command */
    if (kStatus_Success !=
        SDSPI_SendCommand(
            card->host, blockCount == 1U ? (uint32_t)kSDSPI_CmdWriteSigleBlock : (uint32_t)kSDSPI_CmdWriteMultiBlock,
            ((card->flags & (uint32_t)kSDSPI_SupportHighCapacityFlag) == 0U ? (startBlock * card->blockSize) :
                                                                              startBlock),
            &response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }
    /* check response */
    if (response != 0U)
    {
        return kStatus_SDSPI_ResponseError;
    }
    /* write data */
    for (i = 0U; i < blockCount; i++)
    {
        if (kStatus_Success != SDSPI_Write(card->host, buffer, card->blockSize,
                                           blockCount == 1U ? (uint8_t)kSDSPI_DataTokenSingleBlockWrite :
                                                              (uint8_t)kSDSPI_DataTokenMultipleBlockWrite))
        {
            return kStatus_SDSPI_WriteFailed;
        }
        buffer = (uint8_t *)((uint32_t)buffer + card->blockSize);
    }
    /* stop transfer */
    if (blockCount > 1U)
    {
        if (kStatus_Success != SDSPI_Write(card->host, NULL, 0U, (uint8_t)kSDSPI_DataTokenStopTransfer))
        {
            return kStatus_SDSPI_WriteFailed;
        }

        /* Wait the card programming end. */
        if (kStatus_Success != SDSPI_WaitReady(card->host))
        {
            return kStatus_SDSPI_WaitReadyFailed;
        }
    }

    return kStatus_Success;
}

status_t SDSPI_SendPreErase(sdspi_card_t *card, uint32_t blockCount)
{
    assert(blockCount > 1U);

    uint8_t response = 0U;

    /* Pre-erase before writing data */
    if (kStatus_Success != SDSPI_SendApplicationCmd(card))
    {
        return kStatus_SDSPI_SendApplicationCommandFailed;
    }

