adafruit/tinyuf2/ports/mimxrt10xx/apps/factory_test_metro_sd/middleware-sdmmc/sdspi/fsl_sdspi.c
    if (kStatus_Success != SDSPI_SendCommand(card->host, kSDSPI_CmdWrBlkEraseCount, blockCount, &response))
    {
        return kStatus_SDSPI_SendCommandFailed;
    }

    if (response != 0U)
    {
        return kStatus_SDSPI_ResponseError;
    }

    return kStatus_Success;
}

status_t SDSPI_EraseBlocks(sdspi_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card != NULL);
    assert(blockCount != 0U);

    uint32_t blockCountOneTime; /* The block count can be erased in one time sending ERASE_BLOCKS command. */
    uint32_t blockDone = 0U;    /* The block count has been erased. */
    uint32_t blockLeft;         /* Left block count to be erase. */

    blockLeft = blockCount;
    while (blockLeft != 0U)
    {
        if (blockLeft > (card->csd.eraseSectorSize + 1UL))
        {
            blockCountOneTime = card->csd.eraseSectorSize + 1UL;
            blockLeft         = blockLeft - blockCountOneTime;
        }
        else
        {
            blockCountOneTime = blockLeft;
            blockLeft         = 0U;
        }

        if (SDSPI_Erase(card, (startBlock + blockDone), blockCountOneTime) != kStatus_Success)
        {
            return kStatus_Fail;
        }

        blockDone += blockCountOneTime;
    }

    return kStatus_Success;
}

status_t SDSPI_SwitchToHighSpeed(sdspi_card_t *card)
{
    assert(card != NULL);

    if (SDSPI_SelectFunction(card, kSD_GroupTimingMode, kSD_FunctionSDR25HighSpeed) == kStatus_Success)
    {
        (void)card->host->setFrequency(SD_CLOCK_50MHZ > card->host->busBaudRate ? card->host->busBaudRate :
                                                                                  SD_CLOCK_50MHZ);

        return kStatus_Success;
    }

    return kStatus_Fail;
}
